unit herolore3;

{$mode objfpc}{$H+}

{$codepage utf8}

interface

procedure hero_lore_3 ();

implementation

uses

  crt;

procedure hero_lore_3 ();

begin

  textcolor(14);

  writeln('************************************************************************************************************************');
  writeln('*                                                                       _____------__________------_____________       *');
  writeln('*    __________------__________------_____------------------------------                                        `\     *');
  writeln('*   /:--__                                                                                                       |     *');
  writeln('*  ||< > |                                                           _____------__________------_________________/     *');
  writeln('*  | \__/___------__________------_____------------------------------                                         |        *');
  writeln('*  |                                                                                                          |        *');
  writeln('*  |    Ты родился и вырос далеко отсюда, в тихом селении людей в живописной долине южной провинции.           |       *');
  writeln('*   |   Будучи ребёнком, ты был смелым и решительным, и даже физически был развит не по годам, в отличии       |       *');
  writeln('*   |   от своих сверстников, которые при виде тебя не смели обижать младших ребят. Твой отец мечтал, что     |        *');
  writeln('*  |    ты станешь настоящим воином и тренировал тебя. Когда ты стал совсем взрослым, тебя взяли на           |        *');
  writeln('*  |    почётную службу при дворе правителя, ты стал гвардейцем во дворце. Незадолго до ужасных событий        |       *');
  writeln('*  |    связанных с придворным магом ты взял несколько свободных дней, чтобы повидать родных.                  |       *');
  writeln('*   |                                                                                                           |      *');
  writeln('*   |      Ты искал своё истинное предназначение, ты искал своё счастье. Но рано или поздно ты обязан           |      *');
  writeln('*    |     вернуться домой. Ведь ты обещал матери и отцу, что обязательно увидишь их...                          |     *');
  writeln('*    |                                                                                                          |      *');
  writeln('*   |                                                                                                           |      *');
  writeln('*   |                                                              __----~~~~~~~~~~~------___                    |     *');
  writeln('*    |                                                  .  .  ~~///====......          __--~ ~~                  |     *');
  writeln('*    |                                  -.            \_|//     |||\\  ~~~~~~::::... /~                         |      *');
  writeln('*   |                                ___-==_       _-~o~  \/    |||  \\            _/~~-                        |      *');
  writeln('*   |                        __---~~~.==~||\=_    -_--~/_-~|-   |\\   \\        _/~                              |     *');
  writeln('*   |                    _-~~     .=~    |  \\-_    ,-~7  /-   /  ||    \      /                                 |     *');
  writeln('*    |                 .~       .~       |   \\ -_    /  /-   /   ||      \   /                                   |    *');
  writeln('*    |                /  ____  /         |     \\ ~-_/  /|- _/   .||       \ /                                   |     *');
  writeln('*     |               |~~    ~~|--~~~~--_ \     ~==-/   | \~--===~~       .\                                    |      *');
  writeln('*     |                        ,         ~-|      /|    |-~\~~       __--~~                                     |      *');
  writeln('*    |                                     |-~~-_/ |    |   ~\_   _-~            /\                              |     *');
  writeln('*    |                                          /  \     \__   \/~                \__                            |     *');
  writeln('*     |                                     _--~ _/ | .-~~____--~-/                  ~~==.                      |      *');
  writeln('*     |                                    ((->/~   ,.|||, -_|    ~~-/ ,              . _||                     |      *');
  writeln('*    |                                                -_     ~\      ~~---l__i__i__i--~~_/                     |       *');
  writeln('*   |                                                 _-~-__   ~)  \--______________--~~                       |       *');
  writeln('*    |                                              //.-~~~-~_--~- |-------~~~~~~~~                             |      *');
  writeln('*    |   /*\   /*\   /*\   /*\   /*\   /*\                 //.-~~~--\                   /*\   /*\   /*\   /*\   |      *');
  writeln('*   |       \*/   \*/   \*/   \*/   \*/   \*/                                        \*/   \*/   \*/   \*/     |       *');
  writeln('*   |                                                                                                          |       *');
  writeln('*    |                                                                    _____------__________------__________|_      *');
  writeln('*   |  __________------__________------_____------------------------------                                       `\    *');
  writeln('*   |/`--_                                                                                                         |   *');
  writeln('*   ||[ ]||                                                                  _____------__________------__________/    *');
  writeln('*    \===/__________------__________------_____------------------------------                                          *');
  writeln('*                                                                                                                      *');
  writeln('************************************************************************************************************************');

  readln();

end;

end.

