unit elfinprison;

{$mode objfpc}{$H+}

{$codepage utf8}

interface

procedure elf_in_prison ();

implementation

uses

  crt;

procedure elf_in_prison ();

var

  g: integer;
  FF: file of integer;

begin

  textcolor(14);

  writeln('************************************************************************************************************************');
  writeln('*                                                                       _____------__________------_____________       *');
  writeln('*    __________------__________------_____------------------------------                                        `\     *');
  writeln('*   /:--__                                                                                                       |     *');
  writeln('*  ||< > |                                                           _____------__________------_________________/     *');
  writeln('*  | \__/___------__________------_____------------------------------                                         |        *');
  writeln('*  |                                                                                                          |        *');
  writeln('*  |   Постой, приятель! Не бросай меня здесь, я всего лишь несчастный путник! Выпусти меня отсюда скорее!     |       *');
  writeln('*   |  Будь уверен, я крайне полезен тебе в твоём путешествии! Возможно ты и есть тот, кто мне нужен!          |       *');
  writeln('*   |  Я слышу шаги, поторопись! Как только выберемся я расскажу о себе!                                      |        *');
  writeln('*  |                                                                               ;sXs=SV2;                  |        *');
  writeln('*  |       Спасёшь пленного эльфа?                                                ;;Y; _ ^_;                   |       *');
  writeln('*  |                                                                              :LS  a (a(                   |       *');
  writeln('*   |      [Чтобы принять решение введите номер выбранного вами варианта]        ;;;;   .. ;                    |      *');
  writeln('*   |                                                                            ;,;),. ==/;                    |      *');
  writeln('*    |     1. Я спасу пленника! Я думаю, что он поможет                        _.-,;   ,-,;-;_                   |     *');
  writeln('*    |        мне прояснить некоторые детали!                                 /()  ;;    ;; (),.                |      *');
  writeln('*   |                                                                        | ,()_;_____; ,),  \               |      *');
  writeln('*   |      2. Вот ещё! Откуда мне знать кто он такой?                        | | ,;;--- ;;-, |   \               |     *');
  writeln('*    |        Вдруг он ночью ограбит и зарежет меня!                        J  .\,;    ;     | ;--t              |     *');
  writeln('*    |                                                                      |__/ )      ;   / .,,;|             |      *');
  writeln('*   |                                                                       j  ,-,__   __.---;    (             |      *');
  writeln('*   |                                                                        )  ( =r,-| , .  \  ,; )             |     *');
  writeln('*   |                               ,                                        | : "-s=-|   ,  |   ; |             |     *');
  writeln('*    |                               ,                 ,                      L; :  L |      ;     |              |    *');
  writeln('*    |              ,               (                 ,                      J ;    | |   :  ;     |             |     *');
  writeln('*     |            ,                )\                 ,                     L.,     L|       (    |            |      *');
  writeln('*     |             ,               {_}               (                     J ;  :   ||  ,    ;    |            |      *');
  writeln('*    |             (               .-;-.              )\                    | ;      ||  :    ;    |             |     *');
  writeln('*    |             )\             |,-=-,|             {_}                   |,/  ;   ||       ;    \             |     *');
  writeln('*     |            {_}            |     |            .-;-.                  |(   :   ||   __.,     |            |      *');
  writeln('*     |           .-;-.           |     |           |,-=-,|                 | >  |   ||,-,         |            |      *');
  writeln('*    |           |,-=-,|          |     |           |     |                 |/   ;   |Z_,          |           |       *');
  writeln('*   |            |     |          |     |           |     |                 (,  _L---J   ,.        |           |       *');
  writeln('*    |           |     |          \.___./           |     |                  ,-,|       |  ,--._   |            |      *');
  writeln('*    |           |     |                            |     |                     |       :     ; ,-r             |      *');
  writeln('*   |            |     |                            \.___./          .--, ,;,,__/ | ;   ,|    |; ;(-,.--, ,;   |       *');
  writeln('*   |            \.___./                                             .,---,,-----L___;--.,__;-, --,,-.,---,    |       *');
  writeln('*    |                                                                    _____------__________------__________|_      *');
  writeln('*   |  __________------__________------_____------------------------------                                       `\    *');
  writeln('*   |/`--_                                                                                                         |   *');
  writeln('*   ||[ ]||                                                                  _____------__________------__________/    *');
  writeln('*    \===/__________------__________------_____------------------------------                                          *');
  writeln('*                                                                                                                      *');
  writeln('************************************************************************************************************************');

  readln(g);

  if g = 1 then
  begin

    assign(FF, 'companion.dat');
      rewrite(FF);
        write(FF,g);
      close(FF);

  end

  else
  if g = 2 then
  begin

    assign(FF, 'companion.dat');
      rewrite(FF);
        write(FF,g);
      close(FF);

  end;

end;

end.

