unit exithero;

{$mode objfpc}{$H+}

{$codepage utf8}

interface

procedure exit_hero ();

implementation

uses

  crt,
  mmsystem,
  soloway,
  teamway;

procedure exit_hero ();

var

  g: integer;
  FF: file of integer;

begin

  sndplaysound('freedom.wav',snd_async);

  textcolor(14);

  writeln('************************************************************************************************************************');
  writeln('*                                                                       _____------__________------_____________       *');
  writeln('*    __________------__________------_____------------------------------                                        `\     *');
  writeln('*   /:--__                                                                                                       |     *');
  writeln('*  ||< > |                                                           _____------__________------_________________/     *');
  writeln('*  | \__/___------__________------_____------------------------------                                         |        *');
  writeln('*  |                                                                                                          |        *');
  writeln('*  |    Ты наконец-то выбрался из холодных коридоров подземелья наружу. Оглядевшись, ты увидел                 |       *');
  writeln('*   |   полуразрушенную крепость. От башен и стен мало что осталось, именно поэтому разбойники прятались       |       *');
  writeln('*   |   в подземельях давно забытого форта. Но нельзя медлить ни секунды, оглядев своё снаряжение ты          |        *');
  writeln('*  |    отправился подальше от этого места, чтобы хорошо обдумать свои дальнейшие действия...                 |        *');
  writeln('*  |                                                                                                           |       *');
  writeln('*  |                                                                            ____                           |       *');
  writeln('*   |                                                                        __(_   )__                         |      *');
  writeln('*   |                                        Y\          ___               _(          )                        |      *');
  writeln('*    |                                      T  \       __)  )--.          (     )-----`                          |     *');
  writeln('*    |                                     J    \   ,-(         )_         `---,                                |      *');
  writeln('*   |                                     Y/T`-._\ (     (       _)                 __                          |      *');
  writeln('*   |                                     /[|   ]|  `-(__  ___)-`              ,-(  __)                          |     *');
  writeln('*    |                                    | |    |      (__)       _          (     )                            |     *');
  writeln('*    |                        _           | |  ] |                /;\          `-  ,                            |      *');
  writeln('*   |                        (,,)        [| |    |               /;  \                                          |      *');
  writeln('*   |                                   /||.| /\ |   /\         /.,-._\        ___ _                             |     *');
  writeln('*   |                                  /_|||| || |  /  \        | |{  |       (._.,_)                            |     *');
  writeln('*    |                       L/\       | \| | ,` |_ _ /|        | | U |   /\                                      |    *');
  writeln('*    |                      /v^v\/\   `|  Y | [  ,-, ,--,,-,,-"-,`,   | ,`^v\ /\,`\                              |     *');
  writeln('*     |                    / ,,./  \.` |[   |       [     __   L    ] |      /^v\  \                            |      *');
  writeln('*     |                    ,,     `    |    |           ,`##Y.   ]    |___Y Y____,_,,_,,_                       |      *');
  writeln('*    |                     --   -----.-(] [ |   ]     o/####U|o      ]|| /`-, Y   _   Y  Y                       |     *');
  writeln('*    |                        Y Y  --;`~T   |      /   \####U|[\ _,.-(^) ,-,  _  (^)__  _                        |     *');
  writeln('*     |                      Y  YY   ;,~~l  |   L     [|\###U,E,\  \ \Y-` _  (^) _Y  _                          |      *');
  writeln('*     |                     Y  Y Y   ;\~~/\{| [      _,,-\`= = ,.\_ ,`   (^)(^) (^) (^)                         |      *');
  writeln('*    |                          --   ;\~~~/\|  _,.-,`_  `.\_..-,"  _ . ,_ Y_ Y_ _Y  _Y__                       |       *');
  writeln('*   |                          _    _; \~~( Y``   Y (^) / `,      (^)      _   (^) (^)                         |       *');
  writeln('*    |                        (^)  (^)`._~ /  L \  _.Y,`  _  ` --  Y - - -(^) - Y - Y -                         |      *');
  writeln('*    |                         Y    Y    `,--..,-,`      (^)   _  -    _   Y ____                               |      *');
  writeln('*   |                            --           _    _ --   Y   (^)   _ (^)  ===   ----                          |       *');
  writeln('*   |                                __   -  (^)  (^)      --- Y   (^) Y                                       |       *');
  writeln('*    |                                                                    _____------__________------__________|_      *');
  writeln('*   |  __________------__________------_____------------------------------                                       `\    *');
  writeln('*   |/`--_                                                                                                         |   *');
  writeln('*   ||[ ]||                                                                  _____------__________------__________/    *');
  writeln('*    \===/__________------__________------_____------------------------------                                          *');
  writeln('*                                                                                                                      *');
  writeln('************************************************************************************************************************');

  readln();

  clrscr();

  assign(FF, 'companion.dat');
    reset(FF);
      read(FF,g);
    close(FF);

  if g = 1 then
  begin

    team_way();

  end

  else
  if g = 2 then
  begin

    solo_way();

  end;

end;

end.

