unit heroadventure;

{$mode objfpc}{$H+}

{$codepage utf8}

interface

procedure hero_adventure ();

implementation

uses

  crt;

procedure hero_adventure ();

var

  a, i: integer;
  x: array[1..5] of integer;
  FF: file of integer;

begin

  textcolor(14);

  writeln('************************************************************************************************************************');
  writeln('*                                                                       _____------__________------_____________       *');
  writeln('*    __________------__________------_____------------------------------                                        `\     *');
  writeln('*   /:--__                                                                                                       |     *');
  writeln('*  ||< > |                                                           _____------__________------_________________/     *');
  writeln('*  | \__/___------__________------_____------------------------------                                         |        *');
  writeln('*  |                                                                                                          |        *');
  writeln('*  |    Ты слишком долго был вдали от родного дома и вот настал тот день, когда ты, собрав свои нехитрые       |       *');
  writeln('*   |   пожитки, отправляешься в путь домой. Ты много чего повидал за это время, набрался бесценного опыта.    |       *');
  writeln('*   |                                                                                                         |        *');
  writeln('*  |       Ты уже не тот юноша, каким отправился из родительского гнезда, ты стал совсем взрослым и           |        *');
  writeln('*  |       самостоятельным. Ты с нетерпением ждал этого дня и уже представляешь, как будут рады твои           |       *');
  writeln('*  |       родители увидеть тебя живым и здоровым.                                                             |       *');
  writeln('*   |                                                                                                           |      *');
  writeln('*   |         Но на душе у тебя неспокойно, ты чувствуешь вокруг напряжение в ожидании чего-то                  |      *');
  writeln('*    |        нехорошего. Путь твой пролегал сквозь лес. Входя под величественный свод листьев,                  |     *');
  writeln('*    |        ты поёжился. Этот лес ты хорошо знал, но в этот раз он показался тебе неприветливым               |      *');
  writeln('*   |         и даже враждебным. Но вспомнив о своём обещании вернуться домой, ты уверенно зашагал              |      *');
  writeln('*   |         по еле заметной заросшей тропе, уходившей глубоко в таинственную чащу леса...                      |     *');
  writeln('*    |                                                                                                           |     *');
  writeln('*    |                                                                                                          |      *');
  writeln('*   |                                                                                                           |      *');
  writeln('*   |                         .                  .-.    .  _   *     _   .                                       |     *');
  writeln('*   |                                *          /   \     ((       _/ \       *    .                             |     *');
  writeln('*    |                             _    .   .--,\/\_ \     `      /    \  *    ___                                |    *');
  writeln('*    |                         *  / \_    _/ ^      \/\,__        /\/\  /\  __/   \ *                            |     *');
  writeln('*     |                          /    \  /    .,   _/  /  \  *, /    \/  \/ .`,\_/\   .                         |      *');
  writeln('*     |                     .   /\/\  /\/ :, __  ^/  ^/    `--./.,  ^  `-.\ _    _:\ _                          |      *');
  writeln('*    |                         /    \/  \  _/  \-, __/., ^ _   \_   .,\   _/ \ .  __/ \                          |     *');
  writeln('*    |                       /\  .-   `. \/     \ / -.   _/ \ -. `_/   \ /    `._/  ^  \                         |     *');
  writeln('*     |                     /  `-.__ ^   / .-,.--,    . /    `--./ .-,  `-.  `-. `.  -  `.                      |      *');
  writeln('*     |                   @/        `.  / /      `-.   /  .-,   / .   .,   \    \  \  .-  \%                    |      *');
  writeln('*    |                    @&8%:8@@%% @)&@&(88&@.-_=_-=_-=_-=_-=_.8@% &@&&8(8%@%8)(8@%8 8%@)%                   |       *');
  writeln('*   |                     @88:::&(&8&&8:::::%&`.~-_~~-~~_~-~_~-~~=.,@(&%::::%@8&8)::&#@8::::                   |       *');
  writeln('*    |                    `::::::8%@@%:::::@%&8:`.=~~-.~~-.~~=..~,8::::::::&@8:::::&8:::::,                     |      *');
  writeln('*    |                     `::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::.,                      |      *');
  writeln('*   |                                                                                                          |       *');
  writeln('*   |                                                                                                          |       *');
  writeln('*    |                                                                    _____------__________------__________|_      *');
  writeln('*   |  __________------__________------_____------------------------------                                       `\    *');
  writeln('*   |/`--_                                                                                                         |   *');
  writeln('*   ||[ ]||                                                                  _____------__________------__________/    *');
  writeln('*    \===/__________------__________------_____------------------------------                                          *');
  writeln('*                                                                                                                      *');
  writeln('************************************************************************************************************************');

  readln();

  assign(FF, 'playerclass1.dat');
    reset(FF);
      read(FF,a);
    close(FF);

  if a = 1 then
  begin

    x[1] := 10;
    x[2] := 10;
    x[3] := 16;
    x[4] := 10;
    x[5] := 12;

    assign(FF, 'playerclass2.dat');
      rewrite(FF);
        for i := 1 to 5 do
          begin
            write(FF,x[i]);
          end;
      close(FF);

  end

  else
  if a = 2 then
  begin

    x[1] := 10;
    x[2] := 16;
    x[3] := 10;
    x[4] := 14;
    x[5] := 12;

    assign(FF, 'playerclass2.dat');
      rewrite(FF);
        for i := 1 to 5 do
          begin
            write(FF,x[i]);
          end;
      close(FF);

  end

  else
  if a = 3 then
  begin

    x[1] := 16;
    x[2] := 10;
    x[3] := 10;
    x[4] := 10;
    x[5] := 16;

    assign(FF, 'playerclass2.dat');
      rewrite(FF);
        for i := 1 to 5 do
          begin
            write(FF,x[i]);
          end;
      close(FF);

  end;

end;

end.

