unit herolore1;

{$mode objfpc}{$H+}

{$codepage utf8}

interface

procedure hero_lore_1 ();

implementation

uses

  crt;

procedure hero_lore_1 ();

begin

  textcolor(14);

  writeln('************************************************************************************************************************');
  writeln('*                                                                       _____------__________------_____________       *');
  writeln('*    __________------__________------_____------------------------------                                        `\     *');
  writeln('*   /:--__                                                                                                       |     *');
  writeln('*  ||< > |                                                           _____------__________------_________________/     *');
  writeln('*  | \__/___------__________------_____------------------------------                                         |        *');
  writeln('*  |                                                                                                          |        *');
  writeln('*  |    Ты родился и вырос очень далеко отсюда, на родине высших эльфов, как ни странно, ты и в самом деле     |       *');
  writeln('*   |   высший эльф. У тебя от рождения были выдающиеся способности к магии. Когда ты немного подрос,          |       *');
  writeln('*   |   отец стал обучать тебя простейшим заклинаниям, несмотря на запреты со стороны матери.                 |        *');
  writeln('*  |    Она боялась, что использование магии заметят люди, которые издавна недолюбливают высших эльфов.       |        *');
  writeln('*  |    Ты рос и твои навыки улучшались с каждым днём. Ты вырос настоящим воином и немного погодя,             |       *');
  writeln('*  |    уговорив родителей отпустить тебя, отправился в путешествие по миру.                                   |       *');
  writeln('*   |                                                                                                           |      *');
  writeln('*   |      Ты искал своё истинное предназначение, ты искал своё счастье. Но рано или поздно ты обязан           |      *');
  writeln('*    |     вернуться домой. Ведь ты обещал матери и отцу, что обязательно увидишь их...                          |     *');
  writeln('*    |                                                                                                          |      *');
  writeln('*   |                                                                                                           |      *');
  writeln('*   |                                                              __----~~~~~~~~~~~------___                    |     *');
  writeln('*    |                                                  .  .  ~~///====......          __--~ ~~                  |     *');
  writeln('*    |                                  -.            \_|//     |||\\  ~~~~~~::::... /~                         |      *');
  writeln('*   |                                ___-==_       _-~o~  \/    |||  \\            _/~~-                        |      *');
  writeln('*   |                        __---~~~.==~||\=_    -_--~/_-~|-   |\\   \\        _/~                              |     *');
  writeln('*   |                    _-~~     .=~    |  \\-_    ,-~7  /-   /  ||    \      /                                 |     *');
  writeln('*    |                 .~       .~       |   \\ -_    /  /-   /   ||      \   /                                   |    *');
  writeln('*    |                /  ____  /         |     \\ ~-_/  /|- _/   .||       \ /                                   |     *');
  writeln('*     |               |~~    ~~|--~~~~--_ \     ~==-/   | \~--===~~       .\                                    |      *');
  writeln('*     |                        ,         ~-|      /|    |-~\~~       __--~~                                     |      *');
  writeln('*    |                                     |-~~-_/ |    |   ~\_   _-~            /\                              |     *');
  writeln('*    |                                          /  \     \__   \/~                \__                            |     *');
  writeln('*     |                                     _--~ _/ | .-~~____--~-/                  ~~==.                      |      *');
  writeln('*     |                                    ((->/~   ,.|||, -_|    ~~-/ ,              . _||                     |      *');
  writeln('*    |                                                -_     ~\      ~~---l__i__i__i--~~_/                     |       *');
  writeln('*   |                                                 _-~-__   ~)  \--______________--~~                       |       *');
  writeln('*    |                                              //.-~~~-~_--~- |-------~~~~~~~~                             |      *');
  writeln('*    |   /*\   /*\   /*\   /*\   /*\   /*\                 //.-~~~--\                   /*\   /*\   /*\   /*\   |      *');
  writeln('*   |       \*/   \*/   \*/   \*/   \*/   \*/                                        \*/   \*/   \*/   \*/     |       *');
  writeln('*   |                                                                                                          |       *');
  writeln('*    |                                                                    _____------__________------__________|_      *');
  writeln('*   |  __________------__________------_____------------------------------                                       `\    *');
  writeln('*   |/`--_                                                                                                         |   *');
  writeln('*   ||[ ]||                                                                  _____------__________------__________/    *');
  writeln('*    \===/__________------__________------_____------------------------------                                          *');
  writeln('*                                                                                                                      *');
  writeln('************************************************************************************************************************');

  readln();

end;

end.

