unit herodeath;

{$mode objfpc}{$H+}

{$codepage utf8}

interface

procedure hero_death ();

implementation

uses

  crt,
  mmsystem,
  newgame,
  gamedemo;

procedure hero_death ();

var

  h: integer;

begin

  sndplaysound('death.wav',snd_async);

  textcolor(14);

  writeln('************************************************************************************************************************');
  writeln('*                                                                       _____------__________------_____________       *');
  writeln('*    __________------__________------_____------------------------------                                        `\     *');
  writeln('*   /:--__                                                                                                       |     *');
  writeln('*  ||< > |                                                           _____------__________------_________________/     *');
  writeln('*  | \__/___------__________------_____------------------------------                                         |        *');
  writeln('*  |                                                                                                          |        *');
  writeln('*  |                   _..--""---.                                                                             |       *');
  writeln('*   |                 /           ".                        О, БЕССТРАШНЫЙ ИСКАТЕЛЬ ПРИКЛЮЧЕНИЙ!               |       *');
  writeln('*   |                 |,._  ,._ l/"\                                                                          |        *');
  writeln('*  |                  |  _J<__/.v._/                К МОЕМУ ВЕЛИЧАЙШЕМУ СОЖАЛЕНИЮ ТЫ ПАЛ В НЕРАВНОМ БОЮ!      |        *');
  writeln('*  |                   \( ,~._,,,,-)                                                                           |       *');
  writeln('*  |                    `-\, \`,,j|                     САМЫЕ ГОЛОСИСТЫЕ БАРДЫ БУДУТ СЛАГАТЬ О ТЕБЕ            |       *');
  writeln('*   |                      \_,____J                               И ТВОИХ ПОДВИГАХ ПЕСНИ!                       |      *');
  writeln('*   |                 .--.__)--(__.--.                                                                          |      *');
  writeln('*    |               /  `-----..--,. j                    ТЫ ОСМЕЛИЛСЯ БРОСИТЬ ВЫЗОВ ДРЕВНЕМУ ЗЛУ,               |     *');
  writeln('*    |               ,.- ,`--` `--, \\                              ТЫ НАСТОЯЩИЙ ГЕРОЙ!                         |      *');
  writeln('*   |               //  ,,`---,` `-, \\                                                                         |      *');
  writeln('*   |              //   ,`----,`.-.-, \\                ЛЮДИ УВЕКОВЕЧАТ ТВОЁ ИМЯ В ЛЕГЕНДАХ И МИФАХ!             |     *');
  writeln('*    |           _//     `--- -,   \, | \________                                                                |     *');
  writeln('*    |          |  |         ) (      `.__.---- -,\       /*\   /*\   /*\   /*\   /*\   /*\   /*\   /*\   /*\   |      *');
  writeln('*   |            \7          \`-(               74\\\        \*/   \*/   \*/   \*/   \*/   \*/   \*/   \*/      |      *');
  writeln('*   |            ||       _  /`-(               l|//7__                                                          |     *');
  writeln('*   |            |l    (,  `-)-/_.--.          f,,` -.-"|              НО НЕ СТОИТ РАССТРАИВАТЬСЯ, ВЕДЬ ЭТО      |     *');
  writeln('*    |           |\     l\_  `-,    .,         |     |  |                                                         |    *');
  writeln('*    |           llJ   _ _)J--._.-(,           |     |  l                   ВСЕГО ЛИШЬ ИГРА, ТЫ ВСЕГДА           |     *');
  writeln('*     |          |||( ( ,_)_  .l   ". _    ..__I     |  L                                                       |      *');
  writeln('*     |          ^\\\||`,   "   ,"-. " ),,`,---,     L.-,`-.._              МОЖЕШЬ НАЧАТЬ ИГРУ ЗАНОВО,          |      *');
  writeln('*    |                \ |           ) /.     Т В О Й  ``,`-.._``-.                                               |     *');
  writeln('*    |                l l          / / |   П Е Р С О Н А Ж    |,,|           ДЛЯ ЭТОГО НАЖМИ 1! ЕСЛИ             |     *');
  writeln('*     |                " \        / /   "-..__ --------       |  |                                              |      *');
  writeln('*     |                | |       / /          1       ,- t-...J_.,        ЖЕЛАЕШЬ УЙТИ С МИРОМ, НАЖМИ 2!        |      *');
  writeln('*    |                 | |      / /           |       |  |                                                     |       *');
  writeln('*   |                  J  \  /"  (            l       |  |                      ЖЕЛАЮ УДАЧИ, ДРУГ!             |       *');
  writeln('*    |                 | ().,`-()/            |       |  |                                                      |      *');
  writeln('*    |                _.-"_.____/             l       l.-l            /*\   /*\   /*\   /*\   /*\   /*\   /*\   |      *');
  writeln('*   |             _.-"_.+"|                  /        \.  \              \*/   \*/   \*/   \*/   \*/   \*/     |       *');
  writeln('*   |       /"\.-"_.-"  | |                 /          \   \                                                   |       *');
  writeln('*    |      \_   "      | |                1            | `,|             _____------__________------__________|_      *');
  writeln('*   |  __________------__________------_____------------------------------                                       `\    *');
  writeln('*   |/`--_                                                                                                         |   *');
  writeln('*   ||[ ]||                                                                  _____------__________------__________/    *');
  writeln('*    \===/__________------__________------_____------------------------------                                          *');
  writeln('*                                                                                                                      *');
  writeln('************************************************************************************************************************');

  readln(h);

  if h = 1 then
  begin

    clrscr();
    new_game();

  end

  else
  if h = 2 then
  begin

    clrscr();
    game_demo();

  end;

end;

end.

