unit gamelore;

{$mode objfpc}{$H+}

{$codepage utf8}

interface

procedure game_lore ();

implementation

uses

  crt;

procedure game_lore ();

begin

  textcolor(14);

  writeln('************************************************************************************************************************');
  writeln('*                                                                       _____------__________------_____________       *');
  writeln('*    __________------__________------_____------------------------------                                        `\     *');
  writeln('*   /:--__                                                                                                       |     *');
  writeln('*  ||< > |                                                           _____------__________------_________________/     *');
  writeln('*  | \__/___------__________------_____------------------------------                                         |        *');
  writeln('*  |                                                                                                          |        *');
  writeln('*  |     Однажды, давным-давно, в те далёкие времена, когда ещё водилось на белом свете настоящее волшебство,  |       *');
  writeln('*   |    а люди были куда добрее и ближе к природе, чем сейчас, произошла эта невероятная история.             |       *');
  writeln('*   |                                                                                                         |        *');
  writeln('*  |     В древнем королевстве людей приключилась беда, да такая, какой не видели и не слышали со времён      |        *');
  writeln('*  |     первых правителей этих обширных древних земель.                                                       |       *');
  writeln('*  |                                                                                                           |       *');
  writeln('*   |    Придворный маг давно мечтал познать всю великую мощь древних заклинаний. И вот тот долгожданный        |      *');
  writeln('*   |    день настал! В цепкие руки мага попала странная и таинственная рукопись, найденная в древних           |      *');
  writeln('*    |   эльфийских гробницах, недалеко от столицы королевства.                                                  |     *');
  writeln('*    |                                                                                                          |      *');
  writeln('*   |    Та ужасная рукопись хранила в себе древние утерянные заклинания, возвращающие к жизни души тех         |      *');
  writeln('*   |    правителей, что были погребены в сумрачных склепах эльфийских гробниц.                                  |     *');
  writeln('*    |                                                                                                           |     *');
  writeln('*    |   Не сумев совладать с древними чарами, придворный маг навечно стал их пленником. Его тело               |      *');
  writeln('*   |    превратилось в сосуд для душ правителей, вернувшихся в мир живых из далёкого прошлого.                 |      *');
  writeln('*   |                                                                                                            |     *');
  writeln('*   |    Пленённый древними силами маг тайно покинул дворец и ушёл в эльфийские катакомбы, где обрёл редкий      |     *');
  writeln('*    |   дар утерянной и всеми забытой чёрной магии. Он получил навыки, какие не снились ему в самых              |    *');
  writeln('*    |   желанных снах. Он стал могущественным тёмным магом-некромантом!                                         |     *');
  writeln('*     |                                                                                                         |      *');
  writeln('*     |  С тех пор по окрестным дорогам бродят толпы нежити. Некогда охранявшие вечный покой гробниц, они       |      *');
  writeln('*    |   выбираются по ночам из сумеречных холодных склепов катакомб. И с каждым днём                            |     *');
  writeln('*    |   нежити становится всё больше и больше.                                                                  |     *');
  writeln('*     |                                                                                                         |      *');
  writeln('*     |  Древнее зло пробудилось! Лишь отважный герой сможет вернуть мир и покой всем живым в этих землях,      |      *');
  writeln('*    |   а также освободить несчастного мага от злых чар. Скорее собирайся, нам с тобой предстоит долгая       |       *');
  writeln('*   |    дорога, полная опасных приключений! Удачи тебе, друг!                                                 |       *');
  writeln('*    |                                                                                                          |      *');
  writeln('*    |   /*\   /*\   /*\   /*\   /*\   /*\   /*\   /*\   /*\   /*\   /*\   /*\   /*\   /*\   /*\   /*\   /*\    |      *');
  writeln('*   |       \*/   \*/   \*/   \*/   \*/   \*/   \*/   \*/   \*/   \*/   \*/   \*/   \*/   \*/   \*/   \*/      |       *');
  writeln('*   |                                                                                                          |       *');
  writeln('*    |                                                                    _____------__________------__________|_      *');
  writeln('*   |  __________------__________------_____------------------------------                                       `\    *');
  writeln('*   |/`--_                                                                                                         |   *');
  writeln('*   ||[ ]||                                                                  _____------__________------__________/    *');
  writeln('*    \===/__________------__________------_____------------------------------                                          *');
  writeln('*                                                                                                                      *');
  writeln('************************************************************************************************************************');

  readln();

end;

end.

