unit teamway;

{$mode objfpc}{$H+}

{$codepage utf8}

interface

procedure team_way ();

implementation

uses

  crt;

procedure team_way ();

begin

  textcolor(14);

  writeln('************************************************************************************************************************');
  writeln('*                                                                       _____------__________------_____________       *');
  writeln('*    __________------__________------_____------------------------------                                        `\     *');
  writeln('*   /:--__                                                                                                       |     *');
  writeln('*  ||< > |                                                           _____------__________------_________________/     *');
  writeln('*  | \__/___------__________------_____------------------------------                                         |        *');
  writeln('*  |                                                                                                          |        *');
  writeln('*  |   Ты помог выбраться пленнику и теперь вы с ним стояли на лесной тропе обдумывая своё положение           |       *');
  writeln('*   |  и планируя дальнейшие действия...                                                                       |       *');
  writeln('*   |                                                                                                         |        *');
  writeln('*  |       [Чтобы принять решение введите номер выбранного вами варианта]                                     |        *');
  writeln('*  |                                                                                                           |       *');
  writeln('*  |       1. Я отправлюсь поскорее домой! Ведь я так долго ждал встречи с родителями!                         |       *');
  writeln('*   |                                                                                                           |      *');
  writeln('*   |      2. Необходимо вернуться! Меня схватили не просто так, есть некая причина!                            |      *');
  writeln('*    |                                                                                                           |     *');
  writeln('*    |     3. Я отправлюсь прямиком в столицу! У меня нехорошее предчувствие!                                   |      *');
  writeln('*   |                                                                                                           |      *');
  writeln('*   |      4. В ближайшем поселении я распрошу местных жителей о возможных недавних происшествиях!               |     *');
  writeln('*    |                                                                                                           |     *');
  writeln('*    |                                                    |>>>                                                  |      *');
  writeln('*   |                                                     |                                                     |      *');
  writeln('*   |                                       |>>>      _  _|_  _         |>>>                                     |     *');
  writeln('*   |                                       |        |;| |;| |;|        |                                        |     *');
  writeln('*    |                                  _  _|_  _    \\.    .  /    _  _|_  _                                     |    *');
  writeln('*    |                                 |;|_|;|_|;|    \\:. ,  /    |;|_|;|_|;|                                   |     *');
  writeln('*     |            /`\                 \\..      /    ||;   . |    \\.    .  /                                  |      *');
  writeln('*     |                                 \\.  ,  /     ||:  .  |     \\:  .  /              \,/                  |      *');
  writeln('*    |                       /`\         ||:   |_   _ ||_ . _ | _   _||:   |                                     |     *');
  writeln('*    |                                   ||:  .|||_|;|_|;|_|;|_|;|_|;||:.  |                                     |     *');
  writeln('*     |                                  ||:   ||.    .     .      . ||:  .|                                    |      *');
  writeln('*     |                                  ||: . || .     . .   .  ,   ||:   |       \,/                          |      *');
  writeln('*    |                 \,/               ||:   ||:  ,  _______   .   ||: , |                 /`\               |       *');
  writeln('*   |                                    ||:   || .   /+++++++\    . ||:   |                                   |       *');
  writeln('*    |                                __ ||: . ||: ,  |+++++++|.  . _||_   |                                    |      *');
  writeln('*    |                        ___--`~    |--~~__|.    |+++++__|----~    ~`---,              ___                 |      *');
  writeln('*   |        ~~----_____-~--~|                  ~---__|,--~|                  ~~----_____-~|   `~----~~        |       *');
  writeln('*   |                                                                                                          |       *');
  writeln('*    |                                                                    _____------__________------__________|_      *');
  writeln('*   |  __________------__________------_____------------------------------                                       `\    *');
  writeln('*   |/`--_                                                                                                         |   *');
  writeln('*   ||[ ]||                                                                  _____------__________------__________/    *');
  writeln('*    \===/__________------__________------_____------------------------------                                          *');
  writeln('*                                                                                                                      *');
  writeln('************************************************************************************************************************');

  readln();

end;

end.

